tap "homebrew/bundle"
tap "homebrew/services"
tap "koekeishiya/formulae"
brew "bat"
brew "cmake"
brew "eza"
brew "fd"
brew "fzf"
brew "gcc"
brew "gh"
brew "git"
brew "git-delta"
brew "git-secrets"
brew "glances"
brew "htop"
brew "juliaup"
brew "lazygit"
brew "libomp"
brew "llvm"
brew "neovim"
brew "node"
brew "ripgrep"
brew "sheldon"
brew "starship"
brew "stow"
brew "tmux"
brew "tree"
brew "uv"
brew "watch"
brew "wget"
brew "z"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
cask "adobe-acrobat-reader"
cask "alt-tab"
cask "arc"
cask "brave-browser"
cask "claude-code"
cask "cursor"
cask "discord"
cask "font-hack-nerd-font"
cask "ghostty"
cask "google-chrome"
cask "google-drive"
cask "homerow"
cask "karabiner-elements"
cask "mactex-no-gui"
cask "microsoft-auto-update"
cask "microsoft-excel"
cask "microsoft-powerpoint"
cask "microsoft-word"
cask "notion"
cask "notion-calendar"
cask "notion-mail"
cask "raycast"
cask "skim"
cask "slack"
cask "spotify"
cask "visual-studio-code"
cask "warp"
cask "wezterm"
cask "zoom"
vscode "anthropic.claude-code"
vscode "charliermarsh.ruff"
vscode "docker.docker"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.remotehub"
vscode "iamhyc.overleaf-workshop"
vscode "llam4u.nerdtree"
vscode "mathematic.vscode-pdf"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.datawrangler"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "njpwerner.autodocstring"
vscode "oderwat.indent-rainbow"
vscode "pkief.material-icon-theme"
vscode "redhat.vscode-yaml"
vscode "sleistner.vscode-fileutils"
vscode "streetsidesoftware.code-spell-checker"
vscode "usernamehw.errorlens"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "wayou.vscode-todo-highlight"
vscode "yzhang.markdown-all-in-one"
